
def area(a, b):
    '''Возвращает площадь прямоугольника по длине и ширине.

    Параметры:
        a (int, float): длина прямоугольника
        b (int, float): ширина прямоугольника

    Возвращаемое значение:
        float: площадь прямоугольника
    '''
    return a * b

def perimeter(a, b):
    '''Возвращает периметр прямоугольника по длине и ширине.

    Параметры:
        a (int, float): длина прямоугольника
        b (int, float): ширина прямоугольника

    Возвращаемое значение:
        float: периметр прямоугольника
    '''
    return (a + b) * 2